Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: ", go to the sample demo "... /USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code" (example demo).
it_it: ", andare alla demo di esempio "... /USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code" (demo di esempio).

source: "0x5A 0x05 0x07 0x00 0x66" is the command to disable TF-Luna data output.
it_it: "0x5A 0x05 0x07 0x00 0x66" è il comando per disabilitare l'output dati di TF-Luna.

source: "Install Offline"
it_it: "Installazione Offline"

source: "Install Online" or "Install Offline"
it_it: "Installazione online" o "Installazione offline"

source: "PCI Express Root Complex" -> "Intel(R) USB 3.20 Scalable Host Controller - 1.20 (Microsoft)" (may vary from computer to computer) -> "USB Root Hub (USB 3.0)" -> CH347 related devices can be found in "USB Composite Device" of multiple "Universal USB Hubs".
it_it: "PCI Express Root Complex" -> "Intel(R) USB 3.20 Scalable Host Controller - 1.20 (Microsoft)" (può variare da computer a computer) -> "USB Root Hub (USB 3.0)" -> i dispositivi correlati a CH347 si trovano in "USB Composite Device" di diversi "Universal USB Hubs".

source: #The following LVGL configuration items are helpful for frame rate improvement (LVGL v8.3):
it_it: #I seguenti elementi di configurazione LVGL sono utili per migliorare il frame rate (LVGL v8.3):

source: #define CONFIG_EXAMPLE_LCD_TOUCH_CONTROLLER_GT911 0 // 1 initiates the touch, 0 closes the touch.
it_it: #define CONFIG_EXAMPLE_LCD_TOUCH_CONTROLLER_GT911 0 // 1 avvia il touch, 0 lo chiude.

source: #define ESP_OPEN_TOUCH 0 // 1 initiates the touch, 0 closes the touch.
it_it: #define ESP_OPEN_TOUCH 0 // 1 attiva il touch, 0 lo disattiva.

source: #define LV_ATTRIBUTE_FAST_MEM IRAM_ATTR or CONFIG_LV_ATTRIBUTE_FAST_MEM=y
it_it: #define LV_ATTRIBUTE_FAST_MEM IRAM_ATTR o CONFIG_LV_ATTRIBUTE_FAST_MEM=y

source: #define LV_MEMCPY_MEMSET_STD 1 or CONFIG_LV_MEMCPY_MEMSET_STD=y
it_it: #define LV_MEMCPY_MEMSET_STD 1 o CONFIG_LV_MEMCPY_MEMSET_STD=y

source: #define LV_MEM_CUSTOM 1 or CONFIG_LV_MEM_CUSTOM=y
it_it: #define LV_MEM_CUSTOM 1 o CONFIG_LV_MEM_CUSTOM=y

source: (Sample demo)
it_it: (Demo di esempio)

source: (Sample demo).
it_it: (Esempio demo).

source: (Channel): Some CAN interfaces are equipped with more than one CAN port.
it_it: (Channel): Alcune interfacce CAN sono dotate di più di una porta CAN.

source: (If you press Reset, sometimes you need to click the serial monitor again):
it_it: (Se si preme Reset, a volte è necessario cliccare nuovamente sul monitor seriale):

source: (The red indicator of TF-Luna will be off.)
it_it: (L'indicatore rosso di TF-Luna sarà spento.)

source: (device used: 0.96inch OLED (A))
it_it: (dispositivo utilizzato: OLED (A) da 0,96 pollici)

source: -1 if argument<1
it_it: -1 se argomento < 1

source: 1 (the red DIP switch needs to be set to M1/M2 mode)
it_it: 1 (il DIP switch rosso deve essere settato in modalità M1/M2)

source: 1 (the red DIP switch needs to be set to M3 mode)
it_it: 1 (il DIP switch rosso deve essere settato in modalità M3)

source: 1 Introduction
it_it: 1 Introduzione

source: 127 are always automatically stored in the EEPROM of the module, even if the letter A is not shown in the Access column.
it_it: 127 vengono sempre memorizzati automaticamente nella EEPROM del modulo, anche se la lettera A non è visualizzata nella colonna Access.

source: 12PIN IDC connector (the first 4 pins are I2C)
it_it: Connettore 12PIN IDC (i primi 4 pin sono I2C)

source: 12PIN IDC connector (the last 8 pins are JTAG)
it_it: Connettore 12PIN IDC (gli ultimi 8 pin sono JTAG)

source: 12PIN IDC connector (the last 8 pins are SPI)
it_it: Connettore 12PIN IDC (gli ultimi 8 pin sono SPI)

source: 1: It may be caused by the mismatch between the device communicating with this product and the current communication level of the device.
it_it: 1: Potrebbe essere causato da una mancata corrispondenza tra il dispositivo che comunica con questo prodotto e il livello di comunicazione attuale del dispositivo.

source: 2 (the red DIP switch needs to be set to M0 mode)
it_it: 2 (il DIP switch rosso deve essere settato in modalità M0)

source: 2 The Main Window
it_it: 2 La Window Principale

source: 2: It may be caused by the high power consumption of the device communicating with this product or more devices using the VCC port of this product for power supply.
it_it: 2: Potrebbe essere causato dall'elevato consumo energetico del dispositivo che comunica con questo prodotto o di più dispositivi che utilizzano la porta VCC di questo prodotto per l'alimentazione.

source: 3 Connections
it_it: 3 Connessioni

source: 3.0.0 and above
it_it: 3.0.0 e versioni successive

source: 3.3V/5V (select via onboard switch))
it_it: 3.3V/5V (selezionata tramite switch)

source: 3.7V single lithium battery PH2.0 interface
it_it: Interfaccia PH2.0 per batteria al litio singola da 3,7 V

source: 3D Drawing
it_it: Disegno 3D

source: 4 Module specific Tools
it_it: 4 Strumenti Specifici del Modulo

source: 4.3inch display panel connector
it_it: Connettore del pannello display da 4,3 pollici

source: 5 Evaluation Board specific Tools
it_it: 5 Strumenti Specifici dei Tool della Scheda di Valutazione

source: 6 Container Tools
it_it: 6 I Tool Container

source: 6PIN IDC connector
it_it: Connettore 6PIN IDC

source: 7 Wizards
it_it: 7 I Wizard

source: 8 The Syntax of TMCL
it_it: 8 La Sintassi di TMCL

source: 800mA low-noise LDO
it_it: LDO a basso rumore da 800 mA

source: 9 The Syntax of TMCL/PC
it_it: 9 La Sintassi di TMCL/PC

source: <Name> = <Value>
it_it: <Nome> = <Valore>

source: <Name>:
it_it: <Nome>:

source: Click to select the dropdown menu option Select Other Board and Port;
it_it: Cliccare per selezionare l'opzione del menù a discesa Select Other Board and Port;

source: Compile the program; ②.
it_it: Compilare il programma; ②.

source: Please switch to mode0.
it_it: Passare al mode0.

source: Save the selection.
it_it: Salvare la selezione.

source: Search for the required development board model esp32s3 dev module and select;
it_it: Cercare il modello di board di sviluppo desiderato esp32s3 dev module e selezionare;

source: Select COM Port;
it_it: Selezionare COM Port;

source: The latest version can always be found there.
it_it: L'ultima versione è sempre disponibile lì.

source: It works just the same way as the TMCL Position Graph, but works with CANopen objects instead of TMCL parameters.
it_it: Funziona esattamente come il TMCL Position Graph, ma utilizza oggetti CANopen anziché parametri TMCL.

source: It works just the same way as the TMCL Torque Graph, but works with CANopen objects instead of TMCL parameters.
it_it: Funziona esattamente come il grafico di coppia TMCL, ma utilizza oggetti CANopen anziché parametri TMCL.

source: It works just the same way as the TMCL Velocity Graph, but works with CANopen objects instead of TMCL parameters.
it_it: Funziona esattamente come il grafico di velocità TMCL, ma utilizza oggetti CANopen anziché parametri TMCL.

source: It works the same way.
it_it: Funziona allo stesso modo.

source: Please see the TMCL Firmware Manual of your module for further explanations concerning the functionality of all TMCL commands that your module supports.
it_it: Consultare il Manuale del firmware TMCL del modulo per ulteriori spiegazioni sulla funzionalità di tutti i comandi TMCL supportati dal modulo.

source: There is a possibility for performing the tuning both in the auto and manual modes.
it_it: È possibile eseguire la regolazione sia in modalità automatica che manuale.

source: Please see also there.
it_it: Vedere anche lì.

source: Alias is a column with editable fields in the module rows so a unique name can be given.
it_it: Alias è una colonna con campi modificabili nelle righe del modulo, in modo da poter assegnare un nome univoco.

source: Compile and download the program; ③.
it_it: Compilare e scaricare il programma; ③.

source: Flash a given firmware file to the module.
it_it: Installa un file firmware specifico sul modulo.

source: This tool enables writing TMCL instructions for controlling between various modules and their axes.
it_it: Questo strumento consente di scrivere istruzioni TMCL per il controllo tra vari moduli e i loro assi.

source: There you can put together the module definitions and copy them into your TMCL/PC program.
it_it: Qui è possibile assemblare le definizioni dei moduli e copiarle nel programma TMCL/PC.

source: Download successful.
it_it: Download completato.

source: send_message function configures and queues a message containing a specific identifier, data length, and data content for transmission.
it_it: send_message configura e mette in coda un messaggio contenente un identificatore specifico, una lunghezza dei dati e il contenuto dei dati per la trasmissione.

source: You can then easily use these settings in your TMCL program.
it_it: Si può quindi utilizzare facilmente queste impostazioni nel programma TMCL.

source: A Name must always start with a letter or the sign _ and may then contain any combination of letters, numbers and the sign _.
it_it: Un Nome deve sempre iniziare con una lettera o con il segno _ e può quindi contenere qualsiasi combinazione di lettere, numeri e il segno _.

source: A StallGuard profile that has been recorded can be saved using the Save button and loaded for viewing it again using the Load button.
it_it: Un profilo StallGuard registrato può essere salvato utilizzando il pulsante "Save" e caricato per visualizzarlo nuovamente utilizzando il pulsante "Load".

source: A Value must always be a decimal, hexadecimal or binary number or a constant expression.
it_it: Un Valore deve sempre essere un numero decimale, esadecimale o binario oppure un'espressione costante.

source: A blue bullet is displayed in every line where a breakpoint can be set.
it_it: Un punto blu viene visualizzato in ogni riga in cui è possibile impostare un breakpoint.

source: A breakpoint can be removed by clicking on the red bullet again.
it_it: È possibile rimuovere un breakpoint cliccando nuovamente sul pallino rosso.

source: A breakpoint can be set by clicking on a blue bullet and is then indicated by a red bullet.
it_it: È possibile impostare un breakpoint cliccando su un pallino blu e viene quindi indicato da un pallino rosso.

source: A constant expression is just a formula that evaluates to a constant value.
it_it: Un'espressione costante è semplicemente una formula che restituisce un valore costante.

source: A lower value will result in a higher sensitivity.
it_it: Un valore inferiore si tradurrà in una maggiore sensibilità.

source: A module index can be any number between 1 and 255.
it_it: Un indice del modulo può essere un numero qualsiasi compreso tra 1 e 255.

source: A series of I2C utility commands are then registered, such as commands for device detection, register reads and writes, and so on.
it_it: Viene quindi registrata una serie di comandi di utilità I2C, come i comandi per il rilevamento dei dispositivi, le letture e le scritture dei registri e così via.

source: A version for Linux is also available free of charge.
it_it: È disponibile gratuitamente anche una versione per Linux.

source: A0 indicates the address after the device address is shifted to the left by 1 bit (the read/write bit will be handled automatically, just offset the device address by one bit), 00 00 indicates the address of the register to be read.
it_it: A0 indica l'indirizzo dopo che quello del dispositivo è stato spostato a sinistra di 1 bit (il bit di lettura/scrittura verrà gestito automaticamente, basta spostare l'indirizzo del dispositivo di un bit), 00 00 indica l'indirizzo del registro da leggere.

source: A: parameter is automatically stored in the EEPROM of the module
it_it: A: il parametro viene memorizzato automaticamente nella EEPROM del modulo

source: AAP <type>, <axis>, <module index> (Copies the contents of the local accumulator to an axis parameter of a module.)
it_it: AAP <type>, <axis>, <module index> (Copia il contenuto dell'accumulatore locale in un parametro asse di un modulo).

source: ACS: Shows how the register can be accessed.
it_it: ACS: Mostra come è possibile accedere al registro.

source: ADR: The register address in the chip (same as in the chip datasheet).
it_it: ADR: L'indirizzo del registro nel chip (lo stesso del datasheet del chip).

source: AGP <type>, <axis>, <module index> (Copies the contents of the local accumulator to a global parameter of a module.)
it_it: AGP <type>, <axis>, <module index> (Copia il contenuto dell'accumulatore locale in un parametro globale di un modulo).

source: About EDS Files
it_it: I file EDS

source: Absolute value
it_it: Valore assoluto

source: Absolute: Click this button to move to the given target position, as absolute position.
it_it: Absolute: Cliccare su questo pulsante per spostarsi alla posizione di destinazione specificata, come posizione assoluta.

source: Access: The access type of the object.
it_it: Access: Il tipo di accesso dell'oggetto.

source: Activate bitrate: Activates the new bitrate setting on the currently selected device only.
it_it: Activate bitrate: Attiva la nuova impostazione del bitrate solo sul dispositivo attualmente selezionato.

source: Activate bitrate: This will send an LSS activate bitrate command to all LSS devices.
it_it: Activate bitrate: Questo invierà un comando di attivazione del bitrate LSS a tutti i dispositivi LSS.

source: Active Registers
it_it: Registri Attivi

source: Active: use this checkbox to activate or deactivate the selected RPDO (this will internally change bit 31 of its COB-ID).
it_it: Active: utilizzare questa checkbox per attivare o disattivare l'RPDO selezionato (ciò modificherà internamente il bit 31 del suo COB-ID).

source: Active: use this checkbox to activate or to deactivate the selected TPDO (this will internally change bit 31 of its COB-ID).
it_it: Active: utilizzare questo checkbox per attivare o disattivare il TPDO selezionato (ciò modificherà internamente il bit 31 del suo COB-ID).

source: Actual Position: Shows the actual position given in microsteps.
it_it: Actual Position: Mostra la posizione attuale espressa in microstep.

source: Actual speed: Shows the actual speed the motor is running at.
it_it: Actual speed: Mostra la velocità effettiva a cui gira il motore.

source: Add
it_it: Addizione

source: Add configured device: Use this function to add a configured device to the list of LSS modules.
it_it: Add configured device: Utilizzare questa funzione per aggiungere un dispositivo configurato all'elenco dei moduli LSS.

source: Add the corresponding board management link, click the button
it_it: Aggiungere il link del board management corrispondente, cliccare sul pulsante

source: Additionally, it is possible to enable/disable the ramp and the acceleration of the ramp.
it_it: Inoltre è possibile abilitare/disabilitare la rampa e l'accelerazione della rampa.

source: After a TMCL program has been successfully assembled it can be downloaded into the module.
it_it: Dopo che un programma TMCL è stato assemblato correttamente, può essere scaricato nel modulo.

source: After a program has been entered it can be assembled, downloaded to the module and run on the module.
it_it: Una volta inserito, un programma può essere assemblato, scaricato sul modulo ed eseguito su di esso.

source: After a program has been started either by the Run or by the Animate function of the debugger it will be stopped when a breakpoint is reached.
it_it: Dopo che un programma è stato avviato tramite la funzione Run o dalla funzione Animate del debugger, verrà interrotto al raggiungimento di un breakpoint.

source: After a program has been successfully assembled, every line where a breakpoint can be set is indicated by a blue bullet on the left side of the editor.
it_it: Dopo che un programma è stato assemblato correttamente, ogni riga in cui è possibile impostare un breakpoint è indicata da un pallino blu sul lato sinistro dell'editor.

source: After a simple learning, you can start to develop quickly.
it_it: Dopo un semplice apprendimento, è possibile iniziare a sviluppare rapidamente.

source: After an RPDO has been selected, all the objects mapped to that PDO are shown in the PDO Data area on the right hand side of the window.
it_it: Dopo aver selezionato un RPDO, tutti gli oggetti mappati a quel PDO vengono visualizzati nell'area PDO Data sul lato destro della finestra.

source: After configuring USB-CAN-A_TOOL, you can observe the CAN messages sent by the ESP32-S3-Touch-LCD-4.3 upon startup.
it_it: Dopo aver configurato USB-CAN-A_TOOL, è possibile osservare i messaggi CAN inviati dall'ESP32-S3-Touch-LCD-4.3 all'avvio.

source: After connecting the device, select the COM port and model, click below to compile and flash to achieve program control
it_it: Dopo aver collegato il dispositivo, selezionare la porta COM e il modello, quindi cliccare di seguito per compilare e flashare per ottenere il controllo del programma.

source: After downloading the demo, press the RESET button to run the demo.
it_it: Dopo aver scaricato la demo, premere il pulsante RESET per eseguirla.

source: After downloading the installation file (TMCL-IDE-Linux-x64-4.6.0.bin), run this file from the shell by entering ./TMCL-IDE-Linux-x64-4.6.0.bin to start the installation process.
it_it: Dopo aver scaricato il file di installazione (TMCL-IDE-Linux-x64-4.6.0.bin), eseguirlo dalla shell digitando ./TMCL-IDE-Linux-x64-4.6.0.bin per avviare il processo di installazione.

source: After downloading the program, press the RESET button to run the program
it_it: Dopo aver scaricato il programma, premere il pulsante RESET per eseguirlo.

source: After downloading this file, just double click it to start the installation process.
it_it: Dopo aver scaricato questo file, è sufficiente fare doppio clic su di esso per avviare il processo di installazione.

source: After having entered a value for each of the mapped objects, click the Send PDO button to send out the PDO.
it_it: Dopo aver inserito un valore per ciascuno degli oggetti mappati, cliccare sul pulsante Send PDO per inviare il PDO.

source: After having made all necessary changes, click the Send to device button to send all changed PDO communication parameters and mappings to the device.
it_it: Dopo aver apportato tutte le modifiche necessarie, cliccare sul pulsante Send to device per inviare al dispositivo tutti i parametri di comunicazione e le mappature PDO modificati.

source: After having made all necessary settings, the TMCL commands that are necessary to set up StealthChop can directly be copied to the TMCL Creator.
it_it: Dopo aver effettuato tutte le impostazioni necessarie, i comandi TMCL necessari per configurare StealthChop possono essere copiati direttamente in TMCL Creator.

source: After installing a Peak CAN interface for the first time it might not work together with the TMCL-IDE.
it_it: Dopo aver installato un'interfaccia Peak CAN per la prima volta, potrebbe non funzionare con TMCL-IDE.

source: After launching the TMCL-IDE the main window appears on the screen.
it_it: Dopo aver avviato TMCL-IDE, sullo schermo viene visualizzata la finestra principale.

source: After modifying a numerical value here, its background color will be changed to orange.
it_it: Dopo aver modificato un valore numerico, il colore di sfondo diventerà arancione.

source: After picking a module from the list, its actual firmware version will be displayed in the Actual firmware field.
it_it: Dopo aver selezionato un modulo dall'elenco, la sua versione firmware effettiva verrà visualizzata nel campo Actual firmware.

source: After plugging in the USB cable, the module will automatically appear in the module tree on the left hand side of the main window, and the tool tree that contains all tools that can be used with this module will be displayed underneath the module entry in the tree.
it_it: Dopo aver collegato il cavo USB, il modulo apparirà automaticamente nell'albero dei moduli sul lato sinistro della finestra principale e l'albero degli strumenti, che contiene tutti gli strumenti utilizzabili con questo modulo, verrà visualizzato sotto la voce del modulo nell'albero.

source: After running the installation package, the rest can be installed by default, but here for the subsequent experience, it is recommended to check boxes 1, 2, and 3
it_it: Dopo aver eseguito il pacchetto di installazione, il resto può essere installato per default, ma per un'esperienza utente successiva, si consiglia di selezionare le caselle 1, 2 e 3

source: After selecting the model directly, some parameters do not need to be modified by default
it_it: Dopo aver selezionato direttamente il modello, alcuni parametri non devono essere modificati per default

source: After sending, it clears the message data array.
it_it: Dopo l'invio, cancella l'array di dati del messaggio.

source: After successful download, it will automatically enter the serial monitor, you can see the chip output the corresponding information and be prompted to restart after 10S
it_it: Al termine del download, il dispositivo accederà automaticamente al monitor seriale, dove sarà possibile visualizzare le informazioni corrispondenti in uscita dal chip e ricevere la richiesta di riavvio dopo 10 secondi.

source: After successful flashing, press the reset button to run the demo
it_it: Dopo aver completato il flashing, premere il pulsante di reset per avviare la demo.

source: After successful programming, the serial port will print information about the storage card, such as its name, type, capacity, and maximum supported frequency.
it_it: Dopo aver completato la programmazione, la porta seriale visualizzerà informazioni sulla scheda di memoria, come nome, tipo, capacità e frequenza massima supportata.

source: After that, initialize LVGL, create a simple label or an example or demo function that optionally calls LVGL, and release the mutex lock at the end
it_it: Infine, inizializza LVGL, crea un'etichetta semplice o una funzione di esempio o demo che opzionalmente richiama LVGL e rilascia il blocco mutex alla fine.

source: After that, initialize the SPI bus and mount the TF card file system using the configured SPI bus and mount options.
it_it: Successivamente, inizializza il bus SPI e monta il file system della scheda TF utilizzando il bus SPI configurato e le opzioni di montaggio.

source: After that, perform a series of tests on file system operations, including listing directory contents, creating directories, deleting directories, writing to files, appending content to files, reading files, deleting files, renaming files, and testing file input and output, and output the total space and used space size of the TF card.
it_it: Successivamente, si eseguono una serie di test sulle operazioni del file system, tra cui l'elenco del contenuto delle directory, la creazione di directory, l'eliminazione di directory, la scrittura su file, l'aggiunta di contenuto ai file, la lettura di file, l'eliminazione di file, la ridenominazione di file e il test di input e output dei file, nonché la visualizzazione dello spazio totale e dello spazio utilizzato della scheda TF.

source: After the debugger has been successfully started, the debugger functions will be enabled and most other functions of the TMCL Creator will be disabled (in debug mode it is not possible to change the program in the editor).
it_it: Dopo l'avvio corretto del debugger, le funzioni del debugger saranno abilitate e la maggior parte delle altre funzioni di TMCL Creator saranno disabilitate (in modalità debug non è possibile modificare il programma nell'editor).
